<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class QuizSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        /*
        DB::table('quizzes')->insert([
            [
                'title' => "Українська література для 5 класу",
                'description' => "Українська література для 5 класу про ________",
                'quizJSON' => <<<quizJSON
            [[["Героїня легенди __ врятувала людей від посухи. Тепер у країні йдуть дощі"], ["\"Про зоряний віз\""], ["\"Неопалима купина\""], ["\"Берегиня\""]], [["Первісне життя позаду: герої __  вийшли з печер"], ["\"Берегині\""], ["\"Яйця-райця\""], ["\"Хухи-Моховинки\""]], [["Живімо в’єдно»: як __ з людиною почав дружити "], ["пес"], ["Дажбог"], ["Кий"]], [["Оце наш!»: у переказі __  розкрили секрет, як козаки набирали людей до війська"], ["\"Прийом у запорожці\""], ["\"Похід на Царгород\""], ["\"Таємниці козацької шаблі\""]], [["Увага, булінг! Школяр Федько Тойкало вдарив Олеся на очах у однолітків у творі Григора Тютюнника __  "], ["\"Дивак\""], ["\"Сіроманець\""], ["\"Лось\""]], [["Вдалий дебют: молодий письменник Григір Тютюнник випустив свою першу книжку __  "], ["\"Зав’язь\""], ["\"Яйце-райце\""], ["\"Неопалима купина\""]], [["Тараса Шевченка прозвали __ Що думає про це сам геній?  "], ["Великим Кобзарем"], ["Великим Каменярем"], ["Великим Кріпаком"]], [["\"Садок вишневий коло хати, хрущі над вишнями гудуть\": __ поділився своїми дитячими спогадами"], ["\"Великий Кобзар\""], ["\"Великий кріпак\""], ["\"Великим Великий Каменяр \""]], [["Секрет розкрито! Стало відоме справжнє прізвище __ "], ["Олександра Олеся"], ["Павла Тичини"], ["Євгена Гуцала"]], [["Скандал! Олександр Олесь у творі «Ярослав Мудрий» обізвав __ катом"], ["Святополка"], ["Ярослава"], ["Володимира"]], [["Вовк людині друг: герой твору __ потоваришував з вовком, наче з псомкатом"], ["Миколи Вінграновського "], ["Тараса Шевченка"], ["Євгена Гуцала"]], [["\"Гаї шумлять - я слухаю\": __ зачарував новою поезією"], ["Миколи Вінграновського "], ["Тараса Шевченка"], ["Євгена Гуцала"]], [["Леонід Глібов у своєму акровірші заховав __"], ["ластівку"], ["горобця"], ["соловейка"]], [["Павло Тичина рекламує у тт свою нову збірку поезій  __  "], ["\"Сонячні кларнети\""], ["\"Байки Леоніда Глібова\""], ["\"Зів’яле листя\""]], [["\"Осінь-маляр із палітрою пишною...\": __ замилував рідним краєм "], ["Максим Рильський"], ["Євген Гуцало"], ["Микола Вінграновський"]], [[" __ : \"А туман, неначе ворог, закриває море\""], ["Тарас Шевченко"], ["Іван Франко"], ["Євген Гуцало"]], [["\"Бувають роздуми, які вголос краще не висловлювати\" - розмова з авторкою __ Зіркою Мензатюк"], ["\"Таємниці козацької шаблі\""], ["\"Хто сестра і брат?\""], ["\"Яйця-райця\""]], [["Шок! В українській __ розкрили секрет того, як виникли Карпати"], ["легенді"], ["байці"], ["усмішці"]], [["__ розповів про незрозумілі сліди у лісі: \"По лісах дрімучих, темних, з луком пращур наш ішов\""], ["Олександр Олесь"], ["Євген Гуцало"], ["Микола Вінграновський"]]]`,
            quizJSON,
                'dartsJSON' => <<<dartsJSON
            [[["Вірш “Мені тринадцятий минало...” Тарас Шевченко насправді написав не в 13 років. Скільки йому насправді було?"], ["33"], ["22"], ["44"]], [["Саме стільки карбованців заплатили за викуп Тараса Шевченка з кріпацтва"], ["2500"], ["5000"], ["15000"]], [["19 березня 2021 року Ліна Костенко відсвяткувала свій День народження. Їй виповнилося"], ["91"], ["87"], ["102"]], [["У який клас ходила Русалонька, про яку написала Марина Павленко?"], ["7"], ["9"], ["11"]], [["Скільки років було Івану Силі, коли він переїхав у місто?"], ["20"], ["25"], ["12"]], [["Скільки ясних привітів дістали від Олени Теліги її вороги? вірш “Сучасникам”"], ["0"], ["5"], ["12"]], [["Прізвищами скількох дослідників Василь Симоненко називає нових українців?"], ["2"], ["3"], ["17"]], [["Скільки пар очей має людина за твором Василя Симоненка “Ти знаєш, що ти людина”?"], ["1"], ["2"], ["19"]], [["Скільки було братів і сестер у Павлуся із твору “Скарб”?"], ["0"], ["1"], ["15"]], [["Скільки монет  дав Климко швецю за взуття?"], ["0"], ["5"], ["19"]], [["На скільки міст взяли курс козаки за вказівкою Івана Підкови?"], ["1"], ["5"], ["90"]], [["Коли Тараса Шевченка викупили з кріпацтва?"], ["1838"], ["1900"], ["1914"]], [["Коли Тарас Шевченко написав “Мені тринадцятий минало”?"], ["1847"], ["1819"], ["1941"]], [["Скільки дерев стояло посеред поля перед селом Тухля?"], ["1"], ["2"], ["9"]], [["Скільки криночок стоїть у степу в чумацькій пісні?"], ["1"], ["2"], ["3"]], [["Коли вийшла збірка віршів Ліни Костенко “Над берегами вічної ріки”?"], ["1977"], ["1240"], ["1815"]], [["У якому році вперше опублікували повість “Климко”?"], ["1976"], ["2018"], ["2017"]], [["Скільки років було Григору Тютюннику, коли його батька заарештували як ворога народу?"], ["6"], ["19"], ["76"]], [["Скільки крил мала стара качка, що жила в дворі головного героя оповіді “Гуси-лебеді летять”?"], ["1"], ["0"], ["3"]], [["Скільки доньок мав полонений німець Фрідріх з твору “Гер Переможений”?"], ["2"], ["1"], ["5"]]]`,
            dartsJSON,
                'subject_id' => 1
            ],
        ]);
        */
    }
}
